IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART0_UART0.xml
	<register id="UART0_RESUME" acronym="UART0_RESUME" offset="0x2C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESUME" width="8" begin="7" end="0" resetval="0x0" description="Dummy read to restart the TX or RX" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="UART0_RXFLL" acronym="UART0_RXFLL" offset="0x30" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RXFLL" width="8" begin="7" end="0" resetval="0x0" description="LSB register used to specify the frame length in reception" range="7 - 0" rwaccess="WO"/>
	</register>
	<register id="UART0_SFREGL" acronym="UART0_SFREGL" offset="0x30" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="SFREGL" width="8" begin="7" end="0" resetval="0x0" description="LSB part of the frame length" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="UART0_RXFLH" acronym="UART0_RXFLH" offset="0x34" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="4" begin="7" end="4" resetval="0x0" description="Not Defined" range="7 - 4" rwaccess="RO"/> 
		<bitfield id="RXFLH" width="4" begin="3" end="0" resetval="0x0" description="MSB register used to specify the frame length in reception" range="3 - 0" rwaccess="WO"/>
	</register>
	<register id="UART0_SFREGH" acronym="UART0_SFREGH" offset="0x34" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="4" begin="7" end="4" resetval="0x0" description="Not Defined" range="7 - 4" rwaccess="RO"/> 
		<bitfield id="SFREGH" width="4" begin="3" end="0" resetval="0x0" description="MSB part of the frame length" range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="UART0_UASR" acronym="UART0_UASR" offset="0x38" width="8" description="">
		<bitfield id="PARITY_TYPE" width="2" begin="7" end="6" resetval="0x0" description="00 => No Parity identified. 01 => Parity space. 10 => Even Parity. 11 => Odd Parity" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="BIT_BY_CHAR" width="1" begin="5" end="5" resetval="0x0" description="0 => 7 bits character identified. 1 => 8 bits character identified" range="5" rwaccess="RO"/> 
		<bitfield id="SPEED" width="5" begin="4" end="0" resetval="0x0" description="Used to report the speed identified. 00000 => No speed identified. 00001 => 115200 bauds. 00010 => 57600 bauds. 00011 => 38400 bauds. 00100 => 28800 bauds. 00101 => 19200 bauds. 00110 => 14400 bauds. 00111 => 9600 bauds. 01000 => 4800 bauds. 01001 => 2400 bauds. 01010 => 1200 bauds" range="4 - 0" rwaccess="RO"/>
	</register>
	<register id="UART0_BLR" acronym="UART0_BLR" offset="0x38" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="STS_FIFO_RESET" width="1" begin="7" end="7" resetval="0x0" description="Status FIFO reset. This bit is self-clearing" range="7" rwaccess="RW"/> 
		<bitfield id="XBOF_TYPE" width="1" begin="6" end="6" resetval="0x1" description="SIR xBOF select.    0   |   XBOF_TYPE_VALUE_00xFF      1   |   XBOF_TYPE_VALUE_10xC0  " range="6" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="6" begin="5" end="0" resetval="0x0" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="UART0_ACREG" acronym="UART0_ACREG" offset="0x3C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="PULSE_TYPE" width="1" begin="7" end="7" resetval="0x0" description="SIR pulse width select:    0   |   PULSE_TYPE_VALUE_03/16 of baud-rate pulse width      1   |   PULSE_TYPE_VALUE_11.6us  " range="7" rwaccess="RW"/> 
		<bitfield id="SD_MOD" width="1" begin="6" end="6" resetval="0x0" description="Primary output used to configure transceivers. Connected to the SD/MODE input pin of IrDA transceivers.    0   |   SD_MOD_VALUE_0SD pin is set to high      1   |   SD_MOD_VALUE_1SD pin is set to low  " range="6" rwaccess="RW"/> 
		<bitfield id="DIS_IR_RX" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   DIS_IR_RX_VALUE_0Normal operation (RX input automatically disabled during transmit but enabled outside of transmit operation).      1   |   DIS_IR_RX_VALUE_1Disables RX input (permanent state - independent of transmit).  " range="5" rwaccess="RW"/> 
		<bitfield id="DIS_TX_UNDERRUN" width="1" begin="4" end="4" resetval="0x0" description="It is recommended to disable TX FIFO underrun capability by masking corresponding underrun interrupt. When disabling underrun by setting ACREG[4]=1, garbage data is sent over TX line.    0   |   DIS_TX_UNDERRUN_VALUE_0Long stop bits cannot be transmitted, TX underrun is enabled      1   |   DIS_TX_UNDERRUN_VALUE_1Long stop bits can be transmitted, TX underrun is disabled  " range="4" rwaccess="RW"/> 
		<bitfield id="SEND_SIP" width="1" begin="3" end="3" resetval="0x0" description="MIR/FIR Modes only.Send Serial Infrared Interaction Pulse [SIP]If this bit is set during a MIR/FIR transmission, the SIP will be send at the end of it.This bit automatically gets cleared at the end of the SIP transmission.    0   |   SEND_SIP_VALUE_0No action      1   |   SEND_SIP_VALUE_1Send SIP pulse.  " range="3" rwaccess="RW"/> 
		<bitfield id="SCTX_EN" width="1" begin="2" end="2" resetval="0x0" description="Store and controlled TX start. When MDR1[5] = 1 and the LH writes 1 to this bit the TX state machine starts frame transmission. This bit is self-clearing." range="2" rwaccess="RW"/> 
		<bitfield id="ABORT_EN" width="1" begin="1" end="1" resetval="0x0" description="Frame Abort. The LH can intentionally abort transmission of a frame by writing 1 to this bit. Neither the end flag nor the CRC bits are appended to the frame.   If transmit FIFO is not empty and MDR1[5]=1, UART IrDA will start a new transfer with data of previous frame as soon as abort frame has been sent. Therefore, TX FIFO must be reset before sending an abort frame." range="1" rwaccess="RW"/> 
		<bitfield id="EOT_EN" width="1" begin="0" end="0" resetval="0x0" description="EOT [end of transmission] bit. The LH writes 1 to this bit just before it writes the last byte to the TX FIFO in set-EOT bit frame closing method. This bit automatically gets cleared when the LH writes to the THR [TX FIFO]." range="0" rwaccess="RW"/>
	</register>
