IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART0_UART0.xml
	<register id="UART0_SCR" acronym="UART0_SCR" offset="0x40" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RX_TRIG_GRANU1" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    0   |   RX_TRIG_GRANU1_VALUE_0DISABLES THE GRANULARITY OF 1 FOR TRIGGER RX LEVEL.      1   |   RX_TRIG_GRANU1_VALUE_1ENABLES THE GRANULARITY OF 1 FOR TRIGGER RX LEVEL.  " range="7" rwaccess="RW"/> 
		<bitfield id="TX_TRIG_GRANU1" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    0   |   TX_TRIG_GRANU1_VALUE_0DISABLES THE GRANULARITY OF 1 FOR TRIGGER TX LEVEL.      1   |   TX_TRIG_GRANU1_VALUE_1Enables the granularity of 1 for trigger TX level.  " range="6" rwaccess="RW"/> 
		<bitfield id="DSR_IT" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   DSR_IT_VALUE_0DISABLES DSR* INTERRUPT.      1   |   DSR_IT_VALUE_1ENABLES DSR* INTERRUPT.  " range="5" rwaccess="RW"/> 
		<bitfield id="RX_CTS_DSR_WAKE_UP_ENABLE" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    0   |   RX_CTS_DSR_WAKE_UP_ENABLE_VALUE_0DISABLES THE WAKE UP INTERRUPT AND CLEARS SSR[1].      1   |   RX_CTS_DSR_WAKE_UP_ENABLE_VALUE_1Waits for a falling edge of pins RX, CTS* or DSR* to generate an interrupt  " range="4" rwaccess="RW"/> 
		<bitfield id="TX_EMPTY_CTL_IT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   TX_EMPTY_CTL_IT_VALUE_0Normal mode for THR interrupt (See UART mode interrupts table).      1   |   TX_EMPTY_CTL_IT_VALUE_1THE THR INTERRUPT IS GENERATED WHEN TX FIFO AND TX SHIFT REGISTER ARE EMPTY.  " range="3" rwaccess="RW"/> 
		<bitfield id="DMA_MODE_2" width="2" begin="2" end="1" resetval="0x0" description="Used to specify the DMA mode valid if SCR[0] = 1    0x0   |   DMA_MODE_2_VALUE_0DMA mode 0 (no DMA)      0x1   |   DMA_MODE_2_VALUE_1DMA mode 1 (UART_nDMA_REQ[0] in TX, UART_nDMA_REQ[1] in RX)      0x2   |   DMA_MODE_2_VALUE_2DMA mode 2 (UART_nDMA_REQ[0] in RX)      0x3   |   DMA_MODE_2_VALUE_3DMA mode 3 (UART_nDMA_REQ[0] in TX)  " range="2 - 1" rwaccess="RW"/> 
		<bitfield id="DMA_MODE_CTL" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    0   |   DMA_MODE_CTL_VALUE_0The DMA_MODE is set with FCR[3]      1   |   DMA_MODE_CTL_VALUE_1The DMA_MODE is set with SCR[2:1]  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART0_SSR" acronym="UART0_SSR" offset="0x44" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="5" begin="7" end="3" resetval="0x0" description="Not Defined" range="7 - 3" rwaccess="RO"/> 
		<bitfield id="DMA_COUNTER_RST" width="1" begin="2" end="2" resetval="0x1" description="Not Defined    0   |   DMA_COUNTER_RST_VALUE_0The DMA counter will not be reset if the corresponding FIFO is reset (via FCR[1] or FCR[2])      1   |   DMA_COUNTER_RST_VALUE_1The DMA counter will be reset if corresponding FIFO is reset (via FCR[1] or FCR[2])  " range="2" rwaccess="RW"/> 
		<bitfield id="RX_CTS_DSR_WAKE_UP_STS" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read0   |   RX_CTS_DSR_WAKE_UP_STS_VALUE_0No falling edge event on RX, CTS* and DSR*      Read1   |   RX_CTS_DSR_WAKE_UP_STS_VALUE_1A falling edge occurred on RX, CTS* or DSR*  " range="1" rwaccess="RO"/> 
		<bitfield id="TX_FIFO_FULL" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Read0   |   TX_FIFO_FULL_VALUE_0TX FIFO is not full      Read1   |   TX_FIFO_FULL_VALUE_1TX FIFO is full.  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART0_EBLR" acronym="UART0_EBLR" offset="0x48" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="EBLR" width="8" begin="7" end="0" resetval="0x0" description="IR-IRDA mode: This register allows to define up to 176 xBOFs, the maximum required by IrDA specification.IR-CIR mode: This register specifies the number of consecutive zeros to be received before generating the RX_STOP interrupt [IIR[2]].0x00: feature disabled.0x01: generate RX_STOP interrupt after receiving one zero bit....0xFF: generate RX_STOP interrupt after receiving 255 zero bits." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART0_MVR" acronym="UART0_MVR" offset="0x50" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme revision number of module" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="2" begin="29" end="28" resetval="0x0" description="Not Defined" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1858" description="Function revision number of module" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x8" description="Rtl revision number of module" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x6" description="Major revision number of the module." range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom revision number of the module." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x3" description="Minor revision number of the module." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="UART0_SYSC" acronym="UART0_SYSC" offset="0x54" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="Not Defined" range="7 - 5" rwaccess="RO"/> 
		<bitfield id="IDLEMODE" width="2" begin="4" end="3" resetval="0x0" description="POWER MANAGEMENT REQ/ACK CONTROLREF: OCP DESIGN GUIDELINES VERSION 1.1    0x0   |   IDLEMODE_VALUE_0Force idle. An idle request is acknowledged unconditionally      0x1   |   IDLEMODE_VALUE_1No-idle. An idle request is never acknowledged.      0x2   |   IDLEMODE_VALUE_2Smart idle. Acknowledgement to an idle request is given based in the internal activity of the module.      0x3   |   IDLEMODE_VALUE_3reserved  " range="4 - 3" rwaccess="RW"/> 
		<bitfield id="ENAWAKEUP" width="1" begin="2" end="2" resetval="0x0" description="WAKE UP FEATURE CONTROL    0   |   ENAWAKEUP_VALUE_0Wake up is disabled      1   |   ENAWAKEUP_VALUE_1Wake up capability is enabled  " range="2" rwaccess="RW"/> 
		<bitfield id="SOFTRESET" width="1" begin="1" end="1" resetval="0x0" description="Software reset. Set this bit to 1 to trigger a module reset. This bit is automatically reset by the hardware. During reads it always returns a 0.    Write0   |   SOFTRESET_VALUE_0Normal mode      Write1   |   SOFTRESET_VALUE_1The module is reset  " range="1" rwaccess="WO"/> 
		<bitfield id="AUTOIDLE" width="1" begin="0" end="0" resetval="0x0" description="Internal OCP clock gating strategy    0   |   AUTOIDLE_VALUE_0Clock is running      1   |   AUTOIDLE_VALUE_1Automatic OCP clock gating strategy is applied, based on the OCP interface activity  " range="0" rwaccess="RW"/>
	</register>
