IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART0_UART0.xml
	<register id="UART0_SYSS" acronym="UART0_SYSS" offset="0x58" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="7" begin="7" end="1" resetval="0x0" description="Not Defined" range="7 - 1" rwaccess="RO"/> 
		<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x0" description="Internal Reset Monitoring    Read0   |   RESETDONE_VALUE_0Internal Module Reset is ongoing      Read1   |   RESETDONE_VALUE_1Reset completed  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART0_WER" acronym="UART0_WER" offset="0x5C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="EVENT_7_TX_WAKEUP_EN" width="1" begin="7" end="7" resetval="0x1" description="Not Defined    0   |   EVENT_7_TX_WAKEUP_EN_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_7_TX_WAKEUP_EN_VALUE_1EVENT CAN WAKE UP THE SYSTEM: Event can be: THR_IT or TX_DMA request and/or TX_SATUS_IT  " range="7" rwaccess="RW"/> 
		<bitfield id="EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT" width="1" begin="6" end="6" resetval="0x1" description="Not Defined    0   |   EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT_VALUE_1Event can wake up the system  " range="6" rwaccess="RW"/> 
		<bitfield id="EVENT_5_RHR_INTERRUPT" width="1" begin="5" end="5" resetval="0x1" description="Not Defined    0   |   EVENT_5_RHR_INTERRUPT_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_5_RHR_INTERRUPT_VALUE_1Event can wake up the system  " range="5" rwaccess="RW"/> 
		<bitfield id="EVENT_4_RX_ACTIVITY" width="1" begin="4" end="4" resetval="0x1" description="Not Defined    0   |   EVENT_4_RX_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_4_RX_ACTIVITY_VALUE_1Event can wake up the system  " range="4" rwaccess="RW"/> 
		<bitfield id="EVENT_3_DCD_CD_ACTIVITY" width="1" begin="3" end="3" resetval="0x1" description="Not Defined    0   |   EVENT_3_DCD_CD_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_3_DCD_CD_ACTIVITY_VALUE_1Event can wake up the system  " range="3" rwaccess="RW"/> 
		<bitfield id="EVENT_2_RI_ACTIVITY" width="1" begin="2" end="2" resetval="0x1" description="Not Defined    0   |   EVENT_2_RI_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_2_RI_ACTIVITY_VALUE_1Event can wake up the system  " range="2" rwaccess="RW"/> 
		<bitfield id="EVENT_1_DSR_ACTIVITY" width="1" begin="1" end="1" resetval="0x1" description="Not Defined    0   |   EVENT_1_DSR_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_1_DSR_ACTIVITY_VALUE_1Event can wake up the system  " range="1" rwaccess="RW"/> 
		<bitfield id="EVENT_0_CTS_ACTIVITY" width="1" begin="0" end="0" resetval="0x1" description="Not Defined    0   |   EVENT_0_CTS_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_0_CTS_ACTIVITY_VALUE_1Event can wake up the system  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART0_CFPS" acronym="UART0_CFPS" offset="0x60" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="CFPS" width="8" begin="7" end="0" resetval="0x105" description="System clock frequency prescaler at [12x multiple]. Examples for CFPS values are given in the table below.Target Freq [KHz] CFPS [decimal] Actual Freq[KHz] 30   133  30.08 32.75   122  32.79 36   111  36.04 36.7   109  36.69 38*   105  38.1 40   100  40 56.8   70  57.14* configured at reset to this valueNote: CFPS = 0 is not supported." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART0_RXFIFO_LVL" acronym="UART0_RXFIFO_LVL" offset="0x64" width="32" description="">
		<bitfield id="RESERVED24" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RXFIFO_LVL" width="8" begin="7" end="0" resetval="0x0" description="Not Defined" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="UART0_TXFIFO_LVL" acronym="UART0_TXFIFO_LVL" offset="0x68" width="32" description="">
		<bitfield id="RESERVED24" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="TXFIFO_LVL" width="8" begin="7" end="0" resetval="0x0" description="Not Defined" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="UART0_IER2" acronym="UART0_IER2" offset="0x6C" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="5" begin="7" end="3" resetval="0x0" description="Not Defined" range="7 - 3" rwaccess="RO"/> 
		<bitfield id="RHR_IT_DIS" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    0   |   RHR_IT_DIS_VALUE_0Enables the RHR interrupt.      1   |   RHR_IT_DIS_VALUE_1Disables the RHR interrupt.  " range="2" rwaccess="RW"/> 
		<bitfield id="EN_TXFIFO_EMPTY" width="1" begin="1" end="1" resetval="0x0" description="Enables[1]/DISABLES[00 EN_TXFIFO_EMPTY interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="EN_RXFIFO_EMPTY" width="1" begin="0" end="0" resetval="0x0" description="Enables[1]/disables[0] EN_RXFIFO_EMPTY interrupt." range="0" rwaccess="RW"/>
	</register>
	<register id="UART0_ISR2" acronym="UART0_ISR2" offset="0x70" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="6" begin="7" end="2" resetval="0x0" description="Not Defined" range="7 - 2" rwaccess="RO"/> 
		<bitfield id="TXFIFO_EMPTY_STS" width="1" begin="1" end="1" resetval="0x1" description="TXFIFO interrupt pending    0   |   TXFIFO_EMPTY_STS_VALUE_0TXFIFO_EMPTY interrupt not pending.      1   |   TXFIFO_EMPTY_STS_VALUE_1TXFIFO_EMPTY interrupt pending.  " range="1" rwaccess="RW"/> 
		<bitfield id="RXFIFO_EMPTY_STS" width="1" begin="0" end="0" resetval="0x1" description="RXFIFO interrupt pending    0   |   RXFIFO_EMPTY_STS_VALUE_0RXFIFO_EMPTY interrupt not pending.      1   |   RXFIFO_EMPTY_STS_VALUE_1RXFIFO_EMPTY interrupt pending.  " range="0" rwaccess="RW"/>
	</register>
